Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/can.h
/**
 * \brief Component description for CAN
 *
 * Copyright (c) 2019 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-02-20T18:44:00Z */
#ifndef _SAM9X_CAN_COMPONENT_H_
#define _SAM9X_CAN_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR CAN                                          */
/* ************************************************************************** */

/* -------- CAN_MMR : (CAN Offset: 0x00) (R/W 32) Mailbox Mode Register -------- */
#define CAN_MMR_MTIMEMARK_Pos                 _U_(0)                                               /**< (CAN_MMR) Mailbox Timemark Position */
#define CAN_MMR_MTIMEMARK_Msk                 (_U_(0xFFFF) << CAN_MMR_MTIMEMARK_Pos)               /**< (CAN_MMR) Mailbox Timemark Mask */
#define CAN_MMR_MTIMEMARK(value)              (CAN_MMR_MTIMEMARK_Msk & ((value) << CAN_MMR_MTIMEMARK_Pos))
#define CAN_MMR_PRIOR_Pos                     _U_(16)                                              /**< (CAN_MMR) Mailbox Priority Position */
#define CAN_MMR_PRIOR_Msk                     (_U_(0xF) << CAN_MMR_PRIOR_Pos)                      /**< (CAN_MMR) Mailbox Priority Mask */
#define CAN_MMR_PRIOR(value)                  (CAN_MMR_PRIOR_Msk & ((value) << CAN_MMR_PRIOR_Pos))
#define CAN_MMR_MOT_Pos                       _U_(24)                                              /**< (CAN_MMR) Mailbox Object Type Position */
#define CAN_MMR_MOT_Msk                       (_U_(0x7) << CAN_MMR_MOT_Pos)                        /**< (CAN_MMR) Mailbox Object Type Mask */
#define CAN_MMR_MOT(value)                    (CAN_MMR_MOT_Msk & ((value) << CAN_MMR_MOT_Pos))    
#define   CAN_MMR_MOT_MB_DISABLED_Val         _U_(0x0)                                             /**< (CAN_MMR) Mailbox is disabled. This prevents receiving or transmitting any messages with this mailbox.  */
#define   CAN_MMR_MOT_MB_RX_Val               _U_(0x1)                                             /**< (CAN_MMR) Reception Mailbox. Mailbox is configured for reception. If a message is received while the mailbox data register is full, it is discarded.  */
#define   CAN_MMR_MOT_MB_RX_OVERWRITE_Val     _U_(0x2)                                             /**< (CAN_MMR) Reception mailbox with overwrite. Mailbox is configured for reception. If a message is received while the mailbox is full, it overwrites the previous message.  */
#define   CAN_MMR_MOT_MB_TX_Val               _U_(0x3)                                             /**< (CAN_MMR) Transmit mailbox. Mailbox is configured for transmission.  */
#define   CAN_MMR_MOT_MB_CONSUMER_Val         _U_(0x4)                                             /**< (CAN_MMR) Consumer Mailbox. Mailbox is configured in reception but behaves as a Transmit Mailbox, i.e., it sends a remote frame and waits for an answer.  */
#define   CAN_MMR_MOT_MB_PRODUCER_Val         _U_(0x5)                                             /**< (CAN_MMR) Producer Mailbox. Mailbox is configured in transmission but also behaves like a reception mailbox, i.e., it waits to receive a Remote Frame before sending its contents.  */
#define CAN_MMR_MOT_MB_DISABLED               (CAN_MMR_MOT_MB_DISABLED_Val << CAN_MMR_MOT_Pos)     /**< (CAN_MMR) Mailbox is disabled. This prevents receiving or transmitting any messages with this mailbox. Position  */
#define CAN_MMR_MOT_MB_RX                     (CAN_MMR_MOT_MB_RX_Val << CAN_MMR_MOT_Pos)           /**< (CAN_MMR) Reception Mailbox. Mailbox is configured for reception. If a message is received while the mailbox data register is full, it is discarded. Position  */
#define CAN_MMR_MOT_MB_RX_OVERWRITE           (CAN_MMR_MOT_MB_RX_OVERWRITE_Val << CAN_MMR_MOT_Pos) /**< (CAN_MMR) Reception mailbox with overwrite. Mailbox is configured for reception. If a message is received while the mailbox is full, it overwrites the previous message. Position  */
#define CAN_MMR_MOT_MB_TX                     (CAN_MMR_MOT_MB_TX_Val << CAN_MMR_MOT_Pos)           /**< (CAN_MMR) Transmit mailbox. Mailbox is configured for transmission. Position  */
#define CAN_MMR_MOT_MB_CONSUMER               (CAN_MMR_MOT_MB_CONSUMER_Val << CAN_MMR_MOT_Pos)     /**< (CAN_MMR) Consumer Mailbox. Mailbox is configured in reception but behaves as a Transmit Mailbox, i.e., it sends a remote frame and waits for an answer. Position  */
#define CAN_MMR_MOT_MB_PRODUCER               (CAN_MMR_MOT_MB_PRODUCER_Val << CAN_MMR_MOT_Pos)     /**< (CAN_MMR) Producer Mailbox. Mailbox is configured in transmission but also behaves like a reception mailbox, i.e., it waits to receive a Remote Frame before sending its contents. Position  */
#define CAN_MMR_Msk                           _U_(0x070FFFFF)                                      /**< (CAN_MMR) Register Mask  */


/* -------- CAN_MAM : (CAN Offset: 0x04) (R/W 32) Mailbox Acceptance Mask Register -------- */
#define CAN_MAM_MIDvB_Pos                     _U_(0)                                               /**< (CAN_MAM) Complementary bits for identifier in extended frame mode Position */
#define CAN_MAM_MIDvB_Msk                     (_U_(0x3FFFF) << CAN_MAM_MIDvB_Pos)                  /**< (CAN_MAM) Complementary bits for identifier in extended frame mode Mask */
#define CAN_MAM_MIDvB(value)                  (CAN_MAM_MIDvB_Msk & ((value) << CAN_MAM_MIDvB_Pos))
#define CAN_MAM_MIDvA_Pos                     _U_(18)                                              /**< (CAN_MAM) Identifier for standard frame mode Position */
#define CAN_MAM_MIDvA_Msk                     (_U_(0x7FF) << CAN_MAM_MIDvA_Pos)                    /**< (CAN_MAM) Identifier for standard frame mode Mask */
#define CAN_MAM_MIDvA(value)                  (CAN_MAM_MIDvA_Msk & ((value) << CAN_MAM_MIDvA_Pos))
#define CAN_MAM_MIDE_Pos                      _U_(29)                                              /**< (CAN_MAM) Identifier Version Position */
#define CAN_MAM_MIDE_Msk                      (_U_(0x1) << CAN_MAM_MIDE_Pos)                       /**< (CAN_MAM) Identifier Version Mask */
#define CAN_MAM_MIDE(value)                   (CAN_MAM_MIDE_Msk & ((value) << CAN_MAM_MIDE_Pos))  
#define CAN_MAM_Msk                           _U_(0x3FFFFFFF)                                      /**< (CAN_MAM) Register Mask  */


/* -------- CAN_MID : (CAN Offset: 0x08) (R/W 32) Mailbox ID Register -------- */
#define CAN_MID_MIDvB_Pos                     _U_(0)                                               /**< (CAN_MID) Complementary bits for identifier in extended frame mode Position */
#define CAN_MID_MIDvB_Msk                     (_U_(0x3FFFF) << CAN_MID_MIDvB_Pos)                  /**< (CAN_MID) Complementary bits for identifier in extended frame mode Mask */
#define CAN_MID_MIDvB(value)                  (CAN_MID_MIDvB_Msk & ((value) << CAN_MID_MIDvB_Pos))
#define CAN_MID_MIDvA_Pos                     _U_(18)                                              /**< (CAN_MID) Identifier for standard frame mode Position */
#define CAN_MID_MIDvA_Msk                     (_U_(0x7FF) << CAN_MID_MIDvA_Pos)                    /**< (CAN_MID) Identifier for standard frame mode Mask */
#define CAN_MID_MIDvA(value)                  (CAN_MID_MIDvA_Msk & ((value) << CAN_MID_MIDvA_Pos))
#define CAN_MID_MIDE_Pos                      _U_(29)                                              /**< (CAN_MID) Identifier Version Position */
#define CAN_MID_MIDE_Msk                      (_U_(0x1) << CAN_MID_MIDE_Pos)                       /**< (CAN_MID) Identifier Version Mask */
#define CAN_MID_MIDE(value)                   (CAN_MID_MIDE_Msk & ((value) << CAN_MID_MIDE_Pos))  
#define CAN_MID_Msk                           _U_(0x3FFFFFFF)                                      /**< (CAN_MID) Register Mask  */


/* -------- CAN_MFID : (CAN Offset: 0x0C) ( R/ 32) Mailbox Family ID Register -------- */
#define CAN_MFID_MFID_Pos                     _U_(0)                                               /**< (CAN_MFID) Family ID Position */
#define CAN_MFID_MFID_Msk                     (_U_(0x1FFFFFFF) << CAN_MFID_MFID_Pos)               /**< (CAN_MFID) Family ID Mask */
#define CAN_MFID_MFID(value)                  (CAN_MFID_MFID_Msk & ((value) << CAN_MFID_MFID_Pos))
#define CAN_MFID_Msk                          _U_(0x1FFFFFFF)                                      /**< (CAN_MFID) Register Mask  */


/* -------- CAN_MSR : (CAN Offset: 0x10) ( R/ 32) Mailbox Status Register -------- */
#define CAN_MSR_MTIMESTAMP_Pos                _U_(0)                                               /**< (CAN_MSR) Timer Value Position */
#define CAN_MSR_MTIMESTAMP_Msk                (_U_(0xFFFF) << CAN_MSR_MTIMESTAMP_Pos)              /**< (CAN_MSR) Timer Value Mask */
#define CAN_MSR_MTIMESTAMP(value)             (CAN_MSR_MTIMESTAMP_Msk & ((value) << CAN_MSR_MTIMESTAMP_Pos))
#define CAN_MSR_MDLC_Pos                      _U_(16)                                              /**< (CAN_MSR) Mailbox Data Length Code Position */
#define CAN_MSR_MDLC_Msk                      (_U_(0xF) << CAN_MSR_MDLC_Pos)                       /**< (CAN_MSR) Mailbox Data Length Code Mask */
#define CAN_MSR_MDLC(value)                   (CAN_MSR_MDLC_Msk & ((value) << CAN_MSR_MDLC_Pos))  
#define CAN_MSR_MRTR_Pos                      _U_(20)                                              /**< (CAN_MSR) Mailbox Remote Transmission Request Position */
#define CAN_MSR_MRTR_Msk                      (_U_(0x1) << CAN_MSR_MRTR_Pos)                       /**< (CAN_MSR) Mailbox Remote Transmission Request Mask */
#define CAN_MSR_MRTR(value)                   (CAN_MSR_MRTR_Msk & ((value) << CAN_MSR_MRTR_Pos))  
#define CAN_MSR_MABT_Pos                      _U_(22)                                              /**< (CAN_MSR) Mailbox Message Abort (cleared by writing MTCR or MACR in the CAN_MCRx) Position */
#define CAN_MSR_MABT_Msk                      (_U_(0x1) << CAN_MSR_MABT_Pos)                       /**< (CAN_MSR) Mailbox Message Abort (cleared by writing MTCR or MACR in the CAN_MCRx) Mask */
#define CAN_MSR_MABT(value)                   (CAN_MSR_MABT_Msk & ((value) << CAN_MSR_MABT_Pos))  
#define CAN_MSR_MRDY_Pos                      _U_(23)                                              /**< (CAN_MSR) Mailbox Ready (cleared by writing MTCR or MACR in the CAN_MCRx) Position */
#define CAN_MSR_MRDY_Msk                      (_U_(0x1) << CAN_MSR_MRDY_Pos)                       /**< (CAN_MSR) Mailbox Ready (cleared by writing MTCR or MACR in the CAN_MCRx) Mask */
#define CAN_MSR_MRDY(value)                   (CAN_MSR_MRDY_Msk & ((value) << CAN_MSR_MRDY_Pos))  
#define CAN_MSR_MMI_Pos                       _U_(24)                                              /**< (CAN_MSR) Mailbox Message Ignored (cleared by reading CAN_MSRx) Position */
#define CAN_MSR_MMI_Msk                       (_U_(0x1) << CAN_MSR_MMI_Pos)                        /**< (CAN_MSR) Mailbox Message Ignored (cleared by reading CAN_MSRx) Mask */
#define CAN_MSR_MMI(value)                    (CAN_MSR_MMI_Msk & ((value) << CAN_MSR_MMI_Pos))    
#define CAN_MSR_Msk                           _U_(0x01DFFFFF)                                      /**< (CAN_MSR) Register Mask  */


