Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/can.h
/* -------- CAN_MDL : (CAN Offset: 0x14) (R/W 32) Mailbox Data Low Register -------- */
#define CAN_MDL_MDL_Pos                       _U_(0)                                               /**< (CAN_MDL) Message Data Low Value Position */
#define CAN_MDL_MDL_Msk                       (_U_(0xFFFFFFFF) << CAN_MDL_MDL_Pos)                 /**< (CAN_MDL) Message Data Low Value Mask */
#define CAN_MDL_MDL(value)                    (CAN_MDL_MDL_Msk & ((value) << CAN_MDL_MDL_Pos))    
#define CAN_MDL_Msk                           _U_(0xFFFFFFFF)                                      /**< (CAN_MDL) Register Mask  */


/* -------- CAN_MDH : (CAN Offset: 0x18) (R/W 32) Mailbox Data High Register -------- */
#define CAN_MDH_MDH_Pos                       _U_(0)                                               /**< (CAN_MDH) Message Data High Value Position */
#define CAN_MDH_MDH_Msk                       (_U_(0xFFFFFFFF) << CAN_MDH_MDH_Pos)                 /**< (CAN_MDH) Message Data High Value Mask */
#define CAN_MDH_MDH(value)                    (CAN_MDH_MDH_Msk & ((value) << CAN_MDH_MDH_Pos))    
#define CAN_MDH_Msk                           _U_(0xFFFFFFFF)                                      /**< (CAN_MDH) Register Mask  */


/* -------- CAN_MCR : (CAN Offset: 0x1C) ( /W 32) Mailbox Control Register -------- */
#define CAN_MCR_MDLC_Pos                      _U_(16)                                              /**< (CAN_MCR) Mailbox Data Length Code Position */
#define CAN_MCR_MDLC_Msk                      (_U_(0xF) << CAN_MCR_MDLC_Pos)                       /**< (CAN_MCR) Mailbox Data Length Code Mask */
#define CAN_MCR_MDLC(value)                   (CAN_MCR_MDLC_Msk & ((value) << CAN_MCR_MDLC_Pos))  
#define CAN_MCR_MRTR_Pos                      _U_(20)                                              /**< (CAN_MCR) Mailbox Remote Transmission Request Position */
#define CAN_MCR_MRTR_Msk                      (_U_(0x1) << CAN_MCR_MRTR_Pos)                       /**< (CAN_MCR) Mailbox Remote Transmission Request Mask */
#define CAN_MCR_MRTR(value)                   (CAN_MCR_MRTR_Msk & ((value) << CAN_MCR_MRTR_Pos))  
#define CAN_MCR_MACR_Pos                      _U_(22)                                              /**< (CAN_MCR) Abort Request for Mailbox x Position */
#define CAN_MCR_MACR_Msk                      (_U_(0x1) << CAN_MCR_MACR_Pos)                       /**< (CAN_MCR) Abort Request for Mailbox x Mask */
#define CAN_MCR_MACR(value)                   (CAN_MCR_MACR_Msk & ((value) << CAN_MCR_MACR_Pos))  
#define CAN_MCR_MTCR_Pos                      _U_(23)                                              /**< (CAN_MCR) Mailbox Transfer Command Position */
#define CAN_MCR_MTCR_Msk                      (_U_(0x1) << CAN_MCR_MTCR_Pos)                       /**< (CAN_MCR) Mailbox Transfer Command Mask */
#define CAN_MCR_MTCR(value)                   (CAN_MCR_MTCR_Msk & ((value) << CAN_MCR_MTCR_Pos))  
#define CAN_MCR_Msk                           _U_(0x00DF0000)                                      /**< (CAN_MCR) Register Mask  */


/* -------- CAN_MR : (CAN Offset: 0x00) (R/W 32) Mode Register -------- */
#define CAN_MR_CANEN_Pos                      _U_(0)                                               /**< (CAN_MR) CAN Controller Enable Position */
#define CAN_MR_CANEN_Msk                      (_U_(0x1) << CAN_MR_CANEN_Pos)                       /**< (CAN_MR) CAN Controller Enable Mask */
#define CAN_MR_CANEN(value)                   (CAN_MR_CANEN_Msk & ((value) << CAN_MR_CANEN_Pos))  
#define CAN_MR_LPM_Pos                        _U_(1)                                               /**< (CAN_MR) Disable/Enable Low-power Mode Position */
#define CAN_MR_LPM_Msk                        (_U_(0x1) << CAN_MR_LPM_Pos)                         /**< (CAN_MR) Disable/Enable Low-power Mode Mask */
#define CAN_MR_LPM(value)                     (CAN_MR_LPM_Msk & ((value) << CAN_MR_LPM_Pos))      
#define CAN_MR_ABM_Pos                        _U_(2)                                               /**< (CAN_MR) Disable/Enable Autobaud/Listen mode Position */
#define CAN_MR_ABM_Msk                        (_U_(0x1) << CAN_MR_ABM_Pos)                         /**< (CAN_MR) Disable/Enable Autobaud/Listen mode Mask */
#define CAN_MR_ABM(value)                     (CAN_MR_ABM_Msk & ((value) << CAN_MR_ABM_Pos))      
#define CAN_MR_OVL_Pos                        _U_(3)                                               /**< (CAN_MR) Disable/Enable Overload Frame Position */
#define CAN_MR_OVL_Msk                        (_U_(0x1) << CAN_MR_OVL_Pos)                         /**< (CAN_MR) Disable/Enable Overload Frame Mask */
#define CAN_MR_OVL(value)                     (CAN_MR_OVL_Msk & ((value) << CAN_MR_OVL_Pos))      
#define CAN_MR_TEOF_Pos                       _U_(4)                                               /**< (CAN_MR) Timestamp messages at each end of Frame Position */
#define CAN_MR_TEOF_Msk                       (_U_(0x1) << CAN_MR_TEOF_Pos)                        /**< (CAN_MR) Timestamp messages at each end of Frame Mask */
#define CAN_MR_TEOF(value)                    (CAN_MR_TEOF_Msk & ((value) << CAN_MR_TEOF_Pos))    
#define CAN_MR_TTM_Pos                        _U_(5)                                               /**< (CAN_MR) Disable/Enable Time-Triggered Mode Position */
#define CAN_MR_TTM_Msk                        (_U_(0x1) << CAN_MR_TTM_Pos)                         /**< (CAN_MR) Disable/Enable Time-Triggered Mode Mask */
#define CAN_MR_TTM(value)                     (CAN_MR_TTM_Msk & ((value) << CAN_MR_TTM_Pos))      
#define CAN_MR_TIMFRZ_Pos                     _U_(6)                                               /**< (CAN_MR) Enable Timer Freeze Position */
#define CAN_MR_TIMFRZ_Msk                     (_U_(0x1) << CAN_MR_TIMFRZ_Pos)                      /**< (CAN_MR) Enable Timer Freeze Mask */
#define CAN_MR_TIMFRZ(value)                  (CAN_MR_TIMFRZ_Msk & ((value) << CAN_MR_TIMFRZ_Pos))
#define CAN_MR_DRPT_Pos                       _U_(7)                                               /**< (CAN_MR) Disable Repeat Position */
#define CAN_MR_DRPT_Msk                       (_U_(0x1) << CAN_MR_DRPT_Pos)                        /**< (CAN_MR) Disable Repeat Mask */
#define CAN_MR_DRPT(value)                    (CAN_MR_DRPT_Msk & ((value) << CAN_MR_DRPT_Pos))    
#define CAN_MR_RXSYNC_Pos                     _U_(24)                                              /**< (CAN_MR) Reception Synchronization Stage (not readable) Position */
#define CAN_MR_RXSYNC_Msk                     (_U_(0x7) << CAN_MR_RXSYNC_Pos)                      /**< (CAN_MR) Reception Synchronization Stage (not readable) Mask */
#define CAN_MR_RXSYNC(value)                  (CAN_MR_RXSYNC_Msk & ((value) << CAN_MR_RXSYNC_Pos))
#define   CAN_MR_RXSYNC_DOUBLE_PP_Val         _U_(0x0)                                             /**< (CAN_MR) Rx Signal with Double Synchro Stages (2 Positive Edges)  */
#define   CAN_MR_RXSYNC_DOUBLE_PN_Val         _U_(0x1)                                             /**< (CAN_MR) Rx Signal with Double Synchro Stages (One Positive Edge and One Negative Edge)  */
#define   CAN_MR_RXSYNC_SINGLE_P_Val          _U_(0x2)                                             /**< (CAN_MR) Rx Signal with Single Synchro Stage (Positive Edge)  */
#define   CAN_MR_RXSYNC_NONE_Val              _U_(0x3)                                             /**< (CAN_MR) Rx Signal with No Synchro Stage  */
#define CAN_MR_RXSYNC_DOUBLE_PP               (CAN_MR_RXSYNC_DOUBLE_PP_Val << CAN_MR_RXSYNC_Pos)   /**< (CAN_MR) Rx Signal with Double Synchro Stages (2 Positive Edges) Position  */
#define CAN_MR_RXSYNC_DOUBLE_PN               (CAN_MR_RXSYNC_DOUBLE_PN_Val << CAN_MR_RXSYNC_Pos)   /**< (CAN_MR) Rx Signal with Double Synchro Stages (One Positive Edge and One Negative Edge) Position  */
#define CAN_MR_RXSYNC_SINGLE_P                (CAN_MR_RXSYNC_SINGLE_P_Val << CAN_MR_RXSYNC_Pos)    /**< (CAN_MR) Rx Signal with Single Synchro Stage (Positive Edge) Position  */
#define CAN_MR_RXSYNC_NONE                    (CAN_MR_RXSYNC_NONE_Val << CAN_MR_RXSYNC_Pos)        /**< (CAN_MR) Rx Signal with No Synchro Stage Position  */
#define CAN_MR_Msk                            _U_(0x070000FF)                                      /**< (CAN_MR) Register Mask  */


/* -------- CAN_IER : (CAN Offset: 0x04) ( /W 32) Interrupt Enable Register -------- */
#define CAN_IER_MB0_Pos                       _U_(0)                                               /**< (CAN_IER) Mailbox 0 Interrupt Enable Position */
#define CAN_IER_MB0_Msk                       (_U_(0x1) << CAN_IER_MB0_Pos)                        /**< (CAN_IER) Mailbox 0 Interrupt Enable Mask */
#define CAN_IER_MB0(value)                    (CAN_IER_MB0_Msk & ((value) << CAN_IER_MB0_Pos))    
#define CAN_IER_MB1_Pos                       _U_(1)                                               /**< (CAN_IER) Mailbox 1 Interrupt Enable Position */
#define CAN_IER_MB1_Msk                       (_U_(0x1) << CAN_IER_MB1_Pos)                        /**< (CAN_IER) Mailbox 1 Interrupt Enable Mask */
#define CAN_IER_MB1(value)                    (CAN_IER_MB1_Msk & ((value) << CAN_IER_MB1_Pos))    
#define CAN_IER_MB2_Pos                       _U_(2)                                               /**< (CAN_IER) Mailbox 2 Interrupt Enable Position */
#define CAN_IER_MB2_Msk                       (_U_(0x1) << CAN_IER_MB2_Pos)                        /**< (CAN_IER) Mailbox 2 Interrupt Enable Mask */
#define CAN_IER_MB2(value)                    (CAN_IER_MB2_Msk & ((value) << CAN_IER_MB2_Pos))    
#define CAN_IER_MB3_Pos                       _U_(3)                                               /**< (CAN_IER) Mailbox 3 Interrupt Enable Position */
#define CAN_IER_MB3_Msk                       (_U_(0x1) << CAN_IER_MB3_Pos)                        /**< (CAN_IER) Mailbox 3 Interrupt Enable Mask */
#define CAN_IER_MB3(value)                    (CAN_IER_MB3_Msk & ((value) << CAN_IER_MB3_Pos))    
#define CAN_IER_MB4_Pos                       _U_(4)                                               /**< (CAN_IER) Mailbox 4 Interrupt Enable Position */
#define CAN_IER_MB4_Msk                       (_U_(0x1) << CAN_IER_MB4_Pos)                        /**< (CAN_IER) Mailbox 4 Interrupt Enable Mask */
#define CAN_IER_MB4(value)                    (CAN_IER_MB4_Msk & ((value) << CAN_IER_MB4_Pos))    
#define CAN_IER_MB5_Pos                       _U_(5)                                               /**< (CAN_IER) Mailbox 5 Interrupt Enable Position */
#define CAN_IER_MB5_Msk                       (_U_(0x1) << CAN_IER_MB5_Pos)                        /**< (CAN_IER) Mailbox 5 Interrupt Enable Mask */
#define CAN_IER_MB5(value)                    (CAN_IER_MB5_Msk & ((value) << CAN_IER_MB5_Pos))    
#define CAN_IER_MB6_Pos                       _U_(6)                                               /**< (CAN_IER) Mailbox 6 Interrupt Enable Position */
#define CAN_IER_MB6_Msk                       (_U_(0x1) << CAN_IER_MB6_Pos)                        /**< (CAN_IER) Mailbox 6 Interrupt Enable Mask */
#define CAN_IER_MB6(value)                    (CAN_IER_MB6_Msk & ((value) << CAN_IER_MB6_Pos))    
#define CAN_IER_MB7_Pos                       _U_(7)                                               /**< (CAN_IER) Mailbox 7 Interrupt Enable Position */
#define CAN_IER_MB7_Msk                       (_U_(0x1) << CAN_IER_MB7_Pos)                        /**< (CAN_IER) Mailbox 7 Interrupt Enable Mask */
#define CAN_IER_MB7(value)                    (CAN_IER_MB7_Msk & ((value) << CAN_IER_MB7_Pos))    
#define CAN_IER_ERRA_Pos                      _U_(16)                                              /**< (CAN_IER) Error Active Mode Interrupt Enable Position */
#define CAN_IER_ERRA_Msk                      (_U_(0x1) << CAN_IER_ERRA_Pos)                       /**< (CAN_IER) Error Active Mode Interrupt Enable Mask */
#define CAN_IER_ERRA(value)                   (CAN_IER_ERRA_Msk & ((value) << CAN_IER_ERRA_Pos))  
#define CAN_IER_WARN_Pos                      _U_(17)                                              /**< (CAN_IER) Warning Limit Interrupt Enable Position */
#define CAN_IER_WARN_Msk                      (_U_(0x1) << CAN_IER_WARN_Pos)                       /**< (CAN_IER) Warning Limit Interrupt Enable Mask */
#define CAN_IER_WARN(value)                   (CAN_IER_WARN_Msk & ((value) << CAN_IER_WARN_Pos))  
#define CAN_IER_ERRP_Pos                      _U_(18)                                              /**< (CAN_IER) Error Passive Mode Interrupt Enable Position */
#define CAN_IER_ERRP_Msk                      (_U_(0x1) << CAN_IER_ERRP_Pos)                       /**< (CAN_IER) Error Passive Mode Interrupt Enable Mask */
#define CAN_IER_ERRP(value)                   (CAN_IER_ERRP_Msk & ((value) << CAN_IER_ERRP_Pos))  
#define CAN_IER_BOFF_Pos                      _U_(19)                                              /**< (CAN_IER) Bus Off Mode Interrupt Enable Position */
#define CAN_IER_BOFF_Msk                      (_U_(0x1) << CAN_IER_BOFF_Pos)                       /**< (CAN_IER) Bus Off Mode Interrupt Enable Mask */
#define CAN_IER_BOFF(value)                   (CAN_IER_BOFF_Msk & ((value) << CAN_IER_BOFF_Pos))  
#define CAN_IER_SLEEP_Pos                     _U_(20)                                              /**< (CAN_IER) Sleep Interrupt Enable Position */
#define CAN_IER_SLEEP_Msk                     (_U_(0x1) << CAN_IER_SLEEP_Pos)                      /**< (CAN_IER) Sleep Interrupt Enable Mask */
#define CAN_IER_SLEEP(value)                  (CAN_IER_SLEEP_Msk & ((value) << CAN_IER_SLEEP_Pos))
#define CAN_IER_WAKEUP_Pos                    _U_(21)                                              /**< (CAN_IER) Wakeup Interrupt Enable Position */
#define CAN_IER_WAKEUP_Msk                    (_U_(0x1) << CAN_IER_WAKEUP_Pos)                     /**< (CAN_IER) Wakeup Interrupt Enable Mask */
#define CAN_IER_WAKEUP(value)                 (CAN_IER_WAKEUP_Msk & ((value) << CAN_IER_WAKEUP_Pos))
#define CAN_IER_TOVF_Pos                      _U_(22)                                              /**< (CAN_IER) Timer Overflow Interrupt Enable Position */
#define CAN_IER_TOVF_Msk                      (_U_(0x1) << CAN_IER_TOVF_Pos)                       /**< (CAN_IER) Timer Overflow Interrupt Enable Mask */
#define CAN_IER_TOVF(value)                   (CAN_IER_TOVF_Msk & ((value) << CAN_IER_TOVF_Pos))  
#define CAN_IER_TSTP_Pos                      _U_(23)                                              /**< (CAN_IER) TimeStamp Interrupt Enable Position */
#define CAN_IER_TSTP_Msk                      (_U_(0x1) << CAN_IER_TSTP_Pos)                       /**< (CAN_IER) TimeStamp Interrupt Enable Mask */
#define CAN_IER_TSTP(value)                   (CAN_IER_TSTP_Msk & ((value) << CAN_IER_TSTP_Pos))  
#define CAN_IER_CERR_Pos                      _U_(24)                                              /**< (CAN_IER) CRC Error Interrupt Enable Position */
#define CAN_IER_CERR_Msk                      (_U_(0x1) << CAN_IER_CERR_Pos)                       /**< (CAN_IER) CRC Error Interrupt Enable Mask */
#define CAN_IER_CERR(value)                   (CAN_IER_CERR_Msk & ((value) << CAN_IER_CERR_Pos))  
#define CAN_IER_SERR_Pos                      _U_(25)                                              /**< (CAN_IER) Stuffing Error Interrupt Enable Position */
#define CAN_IER_SERR_Msk                      (_U_(0x1) << CAN_IER_SERR_Pos)                       /**< (CAN_IER) Stuffing Error Interrupt Enable Mask */
#define CAN_IER_SERR(value)                   (CAN_IER_SERR_Msk & ((value) << CAN_IER_SERR_Pos))  
#define CAN_IER_AERR_Pos                      _U_(26)                                              /**< (CAN_IER) Acknowledgment Error Interrupt Enable Position */
#define CAN_IER_AERR_Msk                      (_U_(0x1) << CAN_IER_AERR_Pos)                       /**< (CAN_IER) Acknowledgment Error Interrupt Enable Mask */
#define CAN_IER_AERR(value)                   (CAN_IER_AERR_Msk & ((value) << CAN_IER_AERR_Pos))  
#define CAN_IER_FERR_Pos                      _U_(27)                                              /**< (CAN_IER) Form Error Interrupt Enable Position */
#define CAN_IER_FERR_Msk                      (_U_(0x1) << CAN_IER_FERR_Pos)                       /**< (CAN_IER) Form Error Interrupt Enable Mask */
#define CAN_IER_FERR(value)                   (CAN_IER_FERR_Msk & ((value) << CAN_IER_FERR_Pos))  
#define CAN_IER_BERR_Pos                      _U_(28)                                              /**< (CAN_IER) Bit Error Interrupt Enable Position */
#define CAN_IER_BERR_Msk                      (_U_(0x1) << CAN_IER_BERR_Pos)                       /**< (CAN_IER) Bit Error Interrupt Enable Mask */
#define CAN_IER_BERR(value)                   (CAN_IER_BERR_Msk & ((value) << CAN_IER_BERR_Pos))  
#define CAN_IER_Msk                           _U_(0x1FFF00FF)                                      /**< (CAN_IER) Register Mask  */

#define CAN_IER_MB_Pos                        _U_(0)                                               /**< (CAN_IER Position) Mailbox x Interrupt Enable */
#define CAN_IER_MB_Msk                        (_U_(0xFF) << CAN_IER_MB_Pos)                        /**< (CAN_IER Mask) MB */
#define CAN_IER_MB(value)                     (CAN_IER_MB_Msk & ((value) << CAN_IER_MB_Pos))       

