Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/can.h
/* -------- CAN_IDR : (CAN Offset: 0x08) ( /W 32) Interrupt Disable Register -------- */
#define CAN_IDR_MB0_Pos                       _U_(0)                                               /**< (CAN_IDR) Mailbox 0 Interrupt Disable Position */
#define CAN_IDR_MB0_Msk                       (_U_(0x1) << CAN_IDR_MB0_Pos)                        /**< (CAN_IDR) Mailbox 0 Interrupt Disable Mask */
#define CAN_IDR_MB0(value)                    (CAN_IDR_MB0_Msk & ((value) << CAN_IDR_MB0_Pos))    
#define CAN_IDR_MB1_Pos                       _U_(1)                                               /**< (CAN_IDR) Mailbox 1 Interrupt Disable Position */
#define CAN_IDR_MB1_Msk                       (_U_(0x1) << CAN_IDR_MB1_Pos)                        /**< (CAN_IDR) Mailbox 1 Interrupt Disable Mask */
#define CAN_IDR_MB1(value)                    (CAN_IDR_MB1_Msk & ((value) << CAN_IDR_MB1_Pos))    
#define CAN_IDR_MB2_Pos                       _U_(2)                                               /**< (CAN_IDR) Mailbox 2 Interrupt Disable Position */
#define CAN_IDR_MB2_Msk                       (_U_(0x1) << CAN_IDR_MB2_Pos)                        /**< (CAN_IDR) Mailbox 2 Interrupt Disable Mask */
#define CAN_IDR_MB2(value)                    (CAN_IDR_MB2_Msk & ((value) << CAN_IDR_MB2_Pos))    
#define CAN_IDR_MB3_Pos                       _U_(3)                                               /**< (CAN_IDR) Mailbox 3 Interrupt Disable Position */
#define CAN_IDR_MB3_Msk                       (_U_(0x1) << CAN_IDR_MB3_Pos)                        /**< (CAN_IDR) Mailbox 3 Interrupt Disable Mask */
#define CAN_IDR_MB3(value)                    (CAN_IDR_MB3_Msk & ((value) << CAN_IDR_MB3_Pos))    
#define CAN_IDR_MB4_Pos                       _U_(4)                                               /**< (CAN_IDR) Mailbox 4 Interrupt Disable Position */
#define CAN_IDR_MB4_Msk                       (_U_(0x1) << CAN_IDR_MB4_Pos)                        /**< (CAN_IDR) Mailbox 4 Interrupt Disable Mask */
#define CAN_IDR_MB4(value)                    (CAN_IDR_MB4_Msk & ((value) << CAN_IDR_MB4_Pos))    
#define CAN_IDR_MB5_Pos                       _U_(5)                                               /**< (CAN_IDR) Mailbox 5 Interrupt Disable Position */
#define CAN_IDR_MB5_Msk                       (_U_(0x1) << CAN_IDR_MB5_Pos)                        /**< (CAN_IDR) Mailbox 5 Interrupt Disable Mask */
#define CAN_IDR_MB5(value)                    (CAN_IDR_MB5_Msk & ((value) << CAN_IDR_MB5_Pos))    
#define CAN_IDR_MB6_Pos                       _U_(6)                                               /**< (CAN_IDR) Mailbox 6 Interrupt Disable Position */
#define CAN_IDR_MB6_Msk                       (_U_(0x1) << CAN_IDR_MB6_Pos)                        /**< (CAN_IDR) Mailbox 6 Interrupt Disable Mask */
#define CAN_IDR_MB6(value)                    (CAN_IDR_MB6_Msk & ((value) << CAN_IDR_MB6_Pos))    
#define CAN_IDR_MB7_Pos                       _U_(7)                                               /**< (CAN_IDR) Mailbox 7 Interrupt Disable Position */
#define CAN_IDR_MB7_Msk                       (_U_(0x1) << CAN_IDR_MB7_Pos)                        /**< (CAN_IDR) Mailbox 7 Interrupt Disable Mask */
#define CAN_IDR_MB7(value)                    (CAN_IDR_MB7_Msk & ((value) << CAN_IDR_MB7_Pos))    
#define CAN_IDR_ERRA_Pos                      _U_(16)                                              /**< (CAN_IDR) Error Active Mode Interrupt Disable Position */
#define CAN_IDR_ERRA_Msk                      (_U_(0x1) << CAN_IDR_ERRA_Pos)                       /**< (CAN_IDR) Error Active Mode Interrupt Disable Mask */
#define CAN_IDR_ERRA(value)                   (CAN_IDR_ERRA_Msk & ((value) << CAN_IDR_ERRA_Pos))  
#define CAN_IDR_WARN_Pos                      _U_(17)                                              /**< (CAN_IDR) Warning Limit Interrupt Disable Position */
#define CAN_IDR_WARN_Msk                      (_U_(0x1) << CAN_IDR_WARN_Pos)                       /**< (CAN_IDR) Warning Limit Interrupt Disable Mask */
#define CAN_IDR_WARN(value)                   (CAN_IDR_WARN_Msk & ((value) << CAN_IDR_WARN_Pos))  
#define CAN_IDR_ERRP_Pos                      _U_(18)                                              /**< (CAN_IDR) Error Passive Mode Interrupt Disable Position */
#define CAN_IDR_ERRP_Msk                      (_U_(0x1) << CAN_IDR_ERRP_Pos)                       /**< (CAN_IDR) Error Passive Mode Interrupt Disable Mask */
#define CAN_IDR_ERRP(value)                   (CAN_IDR_ERRP_Msk & ((value) << CAN_IDR_ERRP_Pos))  
#define CAN_IDR_BOFF_Pos                      _U_(19)                                              /**< (CAN_IDR) Bus Off Mode Interrupt Disable Position */
#define CAN_IDR_BOFF_Msk                      (_U_(0x1) << CAN_IDR_BOFF_Pos)                       /**< (CAN_IDR) Bus Off Mode Interrupt Disable Mask */
#define CAN_IDR_BOFF(value)                   (CAN_IDR_BOFF_Msk & ((value) << CAN_IDR_BOFF_Pos))  
#define CAN_IDR_SLEEP_Pos                     _U_(20)                                              /**< (CAN_IDR) Sleep Interrupt Disable Position */
#define CAN_IDR_SLEEP_Msk                     (_U_(0x1) << CAN_IDR_SLEEP_Pos)                      /**< (CAN_IDR) Sleep Interrupt Disable Mask */
#define CAN_IDR_SLEEP(value)                  (CAN_IDR_SLEEP_Msk & ((value) << CAN_IDR_SLEEP_Pos))
#define CAN_IDR_WAKEUP_Pos                    _U_(21)                                              /**< (CAN_IDR) Wakeup Interrupt Disable Position */
#define CAN_IDR_WAKEUP_Msk                    (_U_(0x1) << CAN_IDR_WAKEUP_Pos)                     /**< (CAN_IDR) Wakeup Interrupt Disable Mask */
#define CAN_IDR_WAKEUP(value)                 (CAN_IDR_WAKEUP_Msk & ((value) << CAN_IDR_WAKEUP_Pos))
#define CAN_IDR_TOVF_Pos                      _U_(22)                                              /**< (CAN_IDR) Timer Overflow Interrupt Position */
#define CAN_IDR_TOVF_Msk                      (_U_(0x1) << CAN_IDR_TOVF_Pos)                       /**< (CAN_IDR) Timer Overflow Interrupt Mask */
#define CAN_IDR_TOVF(value)                   (CAN_IDR_TOVF_Msk & ((value) << CAN_IDR_TOVF_Pos))  
#define CAN_IDR_TSTP_Pos                      _U_(23)                                              /**< (CAN_IDR) TimeStamp Interrupt Disable Position */
#define CAN_IDR_TSTP_Msk                      (_U_(0x1) << CAN_IDR_TSTP_Pos)                       /**< (CAN_IDR) TimeStamp Interrupt Disable Mask */
#define CAN_IDR_TSTP(value)                   (CAN_IDR_TSTP_Msk & ((value) << CAN_IDR_TSTP_Pos))  
#define CAN_IDR_CERR_Pos                      _U_(24)                                              /**< (CAN_IDR) CRC Error Interrupt Disable Position */
#define CAN_IDR_CERR_Msk                      (_U_(0x1) << CAN_IDR_CERR_Pos)                       /**< (CAN_IDR) CRC Error Interrupt Disable Mask */
#define CAN_IDR_CERR(value)                   (CAN_IDR_CERR_Msk & ((value) << CAN_IDR_CERR_Pos))  
#define CAN_IDR_SERR_Pos                      _U_(25)                                              /**< (CAN_IDR) Stuffing Error Interrupt Disable Position */
#define CAN_IDR_SERR_Msk                      (_U_(0x1) << CAN_IDR_SERR_Pos)                       /**< (CAN_IDR) Stuffing Error Interrupt Disable Mask */
#define CAN_IDR_SERR(value)                   (CAN_IDR_SERR_Msk & ((value) << CAN_IDR_SERR_Pos))  
#define CAN_IDR_AERR_Pos                      _U_(26)                                              /**< (CAN_IDR) Acknowledgment Error Interrupt Disable Position */
#define CAN_IDR_AERR_Msk                      (_U_(0x1) << CAN_IDR_AERR_Pos)                       /**< (CAN_IDR) Acknowledgment Error Interrupt Disable Mask */
#define CAN_IDR_AERR(value)                   (CAN_IDR_AERR_Msk & ((value) << CAN_IDR_AERR_Pos))  
#define CAN_IDR_FERR_Pos                      _U_(27)                                              /**< (CAN_IDR) Form Error Interrupt Disable Position */
#define CAN_IDR_FERR_Msk                      (_U_(0x1) << CAN_IDR_FERR_Pos)                       /**< (CAN_IDR) Form Error Interrupt Disable Mask */
#define CAN_IDR_FERR(value)                   (CAN_IDR_FERR_Msk & ((value) << CAN_IDR_FERR_Pos))  
#define CAN_IDR_BERR_Pos                      _U_(28)                                              /**< (CAN_IDR) Bit Error Interrupt Disable Position */
#define CAN_IDR_BERR_Msk                      (_U_(0x1) << CAN_IDR_BERR_Pos)                       /**< (CAN_IDR) Bit Error Interrupt Disable Mask */
#define CAN_IDR_BERR(value)                   (CAN_IDR_BERR_Msk & ((value) << CAN_IDR_BERR_Pos))  
#define CAN_IDR_Msk                           _U_(0x1FFF00FF)                                      /**< (CAN_IDR) Register Mask  */

#define CAN_IDR_MB_Pos                        _U_(0)                                               /**< (CAN_IDR Position) Mailbox x Interrupt Disable */
#define CAN_IDR_MB_Msk                        (_U_(0xFF) << CAN_IDR_MB_Pos)                        /**< (CAN_IDR Mask) MB */
#define CAN_IDR_MB(value)                     (CAN_IDR_MB_Msk & ((value) << CAN_IDR_MB_Pos))       

/* -------- CAN_IMR : (CAN Offset: 0x0C) ( R/ 32) Interrupt Mask Register -------- */
#define CAN_IMR_MB0_Pos                       _U_(0)                                               /**< (CAN_IMR) Mailbox 0 Interrupt Mask Position */
#define CAN_IMR_MB0_Msk                       (_U_(0x1) << CAN_IMR_MB0_Pos)                        /**< (CAN_IMR) Mailbox 0 Interrupt Mask Mask */
#define CAN_IMR_MB0(value)                    (CAN_IMR_MB0_Msk & ((value) << CAN_IMR_MB0_Pos))    
#define CAN_IMR_MB1_Pos                       _U_(1)                                               /**< (CAN_IMR) Mailbox 1 Interrupt Mask Position */
#define CAN_IMR_MB1_Msk                       (_U_(0x1) << CAN_IMR_MB1_Pos)                        /**< (CAN_IMR) Mailbox 1 Interrupt Mask Mask */
#define CAN_IMR_MB1(value)                    (CAN_IMR_MB1_Msk & ((value) << CAN_IMR_MB1_Pos))    
#define CAN_IMR_MB2_Pos                       _U_(2)                                               /**< (CAN_IMR) Mailbox 2 Interrupt Mask Position */
#define CAN_IMR_MB2_Msk                       (_U_(0x1) << CAN_IMR_MB2_Pos)                        /**< (CAN_IMR) Mailbox 2 Interrupt Mask Mask */
#define CAN_IMR_MB2(value)                    (CAN_IMR_MB2_Msk & ((value) << CAN_IMR_MB2_Pos))    
#define CAN_IMR_MB3_Pos                       _U_(3)                                               /**< (CAN_IMR) Mailbox 3 Interrupt Mask Position */
#define CAN_IMR_MB3_Msk                       (_U_(0x1) << CAN_IMR_MB3_Pos)                        /**< (CAN_IMR) Mailbox 3 Interrupt Mask Mask */
#define CAN_IMR_MB3(value)                    (CAN_IMR_MB3_Msk & ((value) << CAN_IMR_MB3_Pos))    
#define CAN_IMR_MB4_Pos                       _U_(4)                                               /**< (CAN_IMR) Mailbox 4 Interrupt Mask Position */
#define CAN_IMR_MB4_Msk                       (_U_(0x1) << CAN_IMR_MB4_Pos)                        /**< (CAN_IMR) Mailbox 4 Interrupt Mask Mask */
#define CAN_IMR_MB4(value)                    (CAN_IMR_MB4_Msk & ((value) << CAN_IMR_MB4_Pos))    
#define CAN_IMR_MB5_Pos                       _U_(5)                                               /**< (CAN_IMR) Mailbox 5 Interrupt Mask Position */
#define CAN_IMR_MB5_Msk                       (_U_(0x1) << CAN_IMR_MB5_Pos)                        /**< (CAN_IMR) Mailbox 5 Interrupt Mask Mask */
#define CAN_IMR_MB5(value)                    (CAN_IMR_MB5_Msk & ((value) << CAN_IMR_MB5_Pos))    
#define CAN_IMR_MB6_Pos                       _U_(6)                                               /**< (CAN_IMR) Mailbox 6 Interrupt Mask Position */
#define CAN_IMR_MB6_Msk                       (_U_(0x1) << CAN_IMR_MB6_Pos)                        /**< (CAN_IMR) Mailbox 6 Interrupt Mask Mask */
#define CAN_IMR_MB6(value)                    (CAN_IMR_MB6_Msk & ((value) << CAN_IMR_MB6_Pos))    
#define CAN_IMR_MB7_Pos                       _U_(7)                                               /**< (CAN_IMR) Mailbox 7 Interrupt Mask Position */
#define CAN_IMR_MB7_Msk                       (_U_(0x1) << CAN_IMR_MB7_Pos)                        /**< (CAN_IMR) Mailbox 7 Interrupt Mask Mask */
#define CAN_IMR_MB7(value)                    (CAN_IMR_MB7_Msk & ((value) << CAN_IMR_MB7_Pos))    
#define CAN_IMR_ERRA_Pos                      _U_(16)                                              /**< (CAN_IMR) Error Active Mode Interrupt Mask Position */
#define CAN_IMR_ERRA_Msk                      (_U_(0x1) << CAN_IMR_ERRA_Pos)                       /**< (CAN_IMR) Error Active Mode Interrupt Mask Mask */
#define CAN_IMR_ERRA(value)                   (CAN_IMR_ERRA_Msk & ((value) << CAN_IMR_ERRA_Pos))  
#define CAN_IMR_WARN_Pos                      _U_(17)                                              /**< (CAN_IMR) Warning Limit Interrupt Mask Position */
#define CAN_IMR_WARN_Msk                      (_U_(0x1) << CAN_IMR_WARN_Pos)                       /**< (CAN_IMR) Warning Limit Interrupt Mask Mask */
#define CAN_IMR_WARN(value)                   (CAN_IMR_WARN_Msk & ((value) << CAN_IMR_WARN_Pos))  
#define CAN_IMR_ERRP_Pos                      _U_(18)                                              /**< (CAN_IMR) Error Passive Mode Interrupt Mask Position */
#define CAN_IMR_ERRP_Msk                      (_U_(0x1) << CAN_IMR_ERRP_Pos)                       /**< (CAN_IMR) Error Passive Mode Interrupt Mask Mask */
#define CAN_IMR_ERRP(value)                   (CAN_IMR_ERRP_Msk & ((value) << CAN_IMR_ERRP_Pos))  
#define CAN_IMR_BOFF_Pos                      _U_(19)                                              /**< (CAN_IMR) Bus Off Mode Interrupt Mask Position */
#define CAN_IMR_BOFF_Msk                      (_U_(0x1) << CAN_IMR_BOFF_Pos)                       /**< (CAN_IMR) Bus Off Mode Interrupt Mask Mask */
#define CAN_IMR_BOFF(value)                   (CAN_IMR_BOFF_Msk & ((value) << CAN_IMR_BOFF_Pos))  
#define CAN_IMR_SLEEP_Pos                     _U_(20)                                              /**< (CAN_IMR) Sleep Interrupt Mask Position */
#define CAN_IMR_SLEEP_Msk                     (_U_(0x1) << CAN_IMR_SLEEP_Pos)                      /**< (CAN_IMR) Sleep Interrupt Mask Mask */
#define CAN_IMR_SLEEP(value)                  (CAN_IMR_SLEEP_Msk & ((value) << CAN_IMR_SLEEP_Pos))
#define CAN_IMR_WAKEUP_Pos                    _U_(21)                                              /**< (CAN_IMR) Wakeup Interrupt Mask Position */
#define CAN_IMR_WAKEUP_Msk                    (_U_(0x1) << CAN_IMR_WAKEUP_Pos)                     /**< (CAN_IMR) Wakeup Interrupt Mask Mask */
#define CAN_IMR_WAKEUP(value)                 (CAN_IMR_WAKEUP_Msk & ((value) << CAN_IMR_WAKEUP_Pos))
#define CAN_IMR_TOVF_Pos                      _U_(22)                                              /**< (CAN_IMR) Timer Overflow Interrupt Mask Position */
#define CAN_IMR_TOVF_Msk                      (_U_(0x1) << CAN_IMR_TOVF_Pos)                       /**< (CAN_IMR) Timer Overflow Interrupt Mask Mask */
#define CAN_IMR_TOVF(value)                   (CAN_IMR_TOVF_Msk & ((value) << CAN_IMR_TOVF_Pos))  
#define CAN_IMR_TSTP_Pos                      _U_(23)                                              /**< (CAN_IMR) Timestamp Interrupt Mask Position */
#define CAN_IMR_TSTP_Msk                      (_U_(0x1) << CAN_IMR_TSTP_Pos)                       /**< (CAN_IMR) Timestamp Interrupt Mask Mask */
#define CAN_IMR_TSTP(value)                   (CAN_IMR_TSTP_Msk & ((value) << CAN_IMR_TSTP_Pos))  
#define CAN_IMR_CERR_Pos                      _U_(24)                                              /**< (CAN_IMR) CRC Error Interrupt Mask Position */
#define CAN_IMR_CERR_Msk                      (_U_(0x1) << CAN_IMR_CERR_Pos)                       /**< (CAN_IMR) CRC Error Interrupt Mask Mask */
#define CAN_IMR_CERR(value)                   (CAN_IMR_CERR_Msk & ((value) << CAN_IMR_CERR_Pos))  
#define CAN_IMR_SERR_Pos                      _U_(25)                                              /**< (CAN_IMR) Stuffing Error Interrupt Mask Position */
#define CAN_IMR_SERR_Msk                      (_U_(0x1) << CAN_IMR_SERR_Pos)                       /**< (CAN_IMR) Stuffing Error Interrupt Mask Mask */
#define CAN_IMR_SERR(value)                   (CAN_IMR_SERR_Msk & ((value) << CAN_IMR_SERR_Pos))  
#define CAN_IMR_AERR_Pos                      _U_(26)                                              /**< (CAN_IMR) Acknowledgment Error Interrupt Mask Position */
#define CAN_IMR_AERR_Msk                      (_U_(0x1) << CAN_IMR_AERR_Pos)                       /**< (CAN_IMR) Acknowledgment Error Interrupt Mask Mask */
#define CAN_IMR_AERR(value)                   (CAN_IMR_AERR_Msk & ((value) << CAN_IMR_AERR_Pos))  
#define CAN_IMR_FERR_Pos                      _U_(27)                                              /**< (CAN_IMR) Form Error Interrupt Mask Position */
#define CAN_IMR_FERR_Msk                      (_U_(0x1) << CAN_IMR_FERR_Pos)                       /**< (CAN_IMR) Form Error Interrupt Mask Mask */
#define CAN_IMR_FERR(value)                   (CAN_IMR_FERR_Msk & ((value) << CAN_IMR_FERR_Pos))  
#define CAN_IMR_BERR_Pos                      _U_(28)                                              /**< (CAN_IMR) Bit Error Interrupt Mask Position */
#define CAN_IMR_BERR_Msk                      (_U_(0x1) << CAN_IMR_BERR_Pos)                       /**< (CAN_IMR) Bit Error Interrupt Mask Mask */
#define CAN_IMR_BERR(value)                   (CAN_IMR_BERR_Msk & ((value) << CAN_IMR_BERR_Pos))  
#define CAN_IMR_Msk                           _U_(0x1FFF00FF)                                      /**< (CAN_IMR) Register Mask  */

#define CAN_IMR_MB_Pos                        _U_(0)                                               /**< (CAN_IMR Position) Mailbox x Interrupt Mask */
#define CAN_IMR_MB_Msk                        (_U_(0xFF) << CAN_IMR_MB_Pos)                        /**< (CAN_IMR Mask) MB */
#define CAN_IMR_MB(value)                     (CAN_IMR_MB_Msk & ((value) << CAN_IMR_MB_Pos))       

