Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/can.h
/* -------- CAN_SR : (CAN Offset: 0x10) ( R/ 32) Status Register -------- */
#define CAN_SR_MB0_Pos                        _U_(0)                                               /**< (CAN_SR) Mailbox 0 Event Position */
#define CAN_SR_MB0_Msk                        (_U_(0x1) << CAN_SR_MB0_Pos)                         /**< (CAN_SR) Mailbox 0 Event Mask */
#define CAN_SR_MB0(value)                     (CAN_SR_MB0_Msk & ((value) << CAN_SR_MB0_Pos))      
#define CAN_SR_MB1_Pos                        _U_(1)                                               /**< (CAN_SR) Mailbox 1 Event Position */
#define CAN_SR_MB1_Msk                        (_U_(0x1) << CAN_SR_MB1_Pos)                         /**< (CAN_SR) Mailbox 1 Event Mask */
#define CAN_SR_MB1(value)                     (CAN_SR_MB1_Msk & ((value) << CAN_SR_MB1_Pos))      
#define CAN_SR_MB2_Pos                        _U_(2)                                               /**< (CAN_SR) Mailbox 2 Event Position */
#define CAN_SR_MB2_Msk                        (_U_(0x1) << CAN_SR_MB2_Pos)                         /**< (CAN_SR) Mailbox 2 Event Mask */
#define CAN_SR_MB2(value)                     (CAN_SR_MB2_Msk & ((value) << CAN_SR_MB2_Pos))      
#define CAN_SR_MB3_Pos                        _U_(3)                                               /**< (CAN_SR) Mailbox 3 Event Position */
#define CAN_SR_MB3_Msk                        (_U_(0x1) << CAN_SR_MB3_Pos)                         /**< (CAN_SR) Mailbox 3 Event Mask */
#define CAN_SR_MB3(value)                     (CAN_SR_MB3_Msk & ((value) << CAN_SR_MB3_Pos))      
#define CAN_SR_MB4_Pos                        _U_(4)                                               /**< (CAN_SR) Mailbox 4 Event Position */
#define CAN_SR_MB4_Msk                        (_U_(0x1) << CAN_SR_MB4_Pos)                         /**< (CAN_SR) Mailbox 4 Event Mask */
#define CAN_SR_MB4(value)                     (CAN_SR_MB4_Msk & ((value) << CAN_SR_MB4_Pos))      
#define CAN_SR_MB5_Pos                        _U_(5)                                               /**< (CAN_SR) Mailbox 5 Event Position */
#define CAN_SR_MB5_Msk                        (_U_(0x1) << CAN_SR_MB5_Pos)                         /**< (CAN_SR) Mailbox 5 Event Mask */
#define CAN_SR_MB5(value)                     (CAN_SR_MB5_Msk & ((value) << CAN_SR_MB5_Pos))      
#define CAN_SR_MB6_Pos                        _U_(6)                                               /**< (CAN_SR) Mailbox 6 Event Position */
#define CAN_SR_MB6_Msk                        (_U_(0x1) << CAN_SR_MB6_Pos)                         /**< (CAN_SR) Mailbox 6 Event Mask */
#define CAN_SR_MB6(value)                     (CAN_SR_MB6_Msk & ((value) << CAN_SR_MB6_Pos))      
#define CAN_SR_MB7_Pos                        _U_(7)                                               /**< (CAN_SR) Mailbox 7 Event Position */
#define CAN_SR_MB7_Msk                        (_U_(0x1) << CAN_SR_MB7_Pos)                         /**< (CAN_SR) Mailbox 7 Event Mask */
#define CAN_SR_MB7(value)                     (CAN_SR_MB7_Msk & ((value) << CAN_SR_MB7_Pos))      
#define CAN_SR_ERRA_Pos                       _U_(16)                                              /**< (CAN_SR) Error Active Mode (automatically cleared by reading CAN_SR) Position */
#define CAN_SR_ERRA_Msk                       (_U_(0x1) << CAN_SR_ERRA_Pos)                        /**< (CAN_SR) Error Active Mode (automatically cleared by reading CAN_SR) Mask */
#define CAN_SR_ERRA(value)                    (CAN_SR_ERRA_Msk & ((value) << CAN_SR_ERRA_Pos))    
#define CAN_SR_WARN_Pos                       _U_(17)                                              /**< (CAN_SR) Warning Limit (automatically cleared by reading CAN_SR) Position */
#define CAN_SR_WARN_Msk                       (_U_(0x1) << CAN_SR_WARN_Pos)                        /**< (CAN_SR) Warning Limit (automatically cleared by reading CAN_SR) Mask */
#define CAN_SR_WARN(value)                    (CAN_SR_WARN_Msk & ((value) << CAN_SR_WARN_Pos))    
#define CAN_SR_ERRP_Pos                       _U_(18)                                              /**< (CAN_SR) Error Passive Mode (automatically cleared by reading CAN_SR) Position */
#define CAN_SR_ERRP_Msk                       (_U_(0x1) << CAN_SR_ERRP_Pos)                        /**< (CAN_SR) Error Passive Mode (automatically cleared by reading CAN_SR) Mask */
#define CAN_SR_ERRP(value)                    (CAN_SR_ERRP_Msk & ((value) << CAN_SR_ERRP_Pos))    
#define CAN_SR_BOFF_Pos                       _U_(19)                                              /**< (CAN_SR) Bus Off Mode (automatically cleared by reading CAN_SR) Position */
#define CAN_SR_BOFF_Msk                       (_U_(0x1) << CAN_SR_BOFF_Pos)                        /**< (CAN_SR) Bus Off Mode (automatically cleared by reading CAN_SR) Mask */
#define CAN_SR_BOFF(value)                    (CAN_SR_BOFF_Msk & ((value) << CAN_SR_BOFF_Pos))    
#define CAN_SR_SLEEP_Pos                      _U_(20)                                              /**< (CAN_SR) CAN Controller in Low-power Mode Position */
#define CAN_SR_SLEEP_Msk                      (_U_(0x1) << CAN_SR_SLEEP_Pos)                       /**< (CAN_SR) CAN Controller in Low-power Mode Mask */
#define CAN_SR_SLEEP(value)                   (CAN_SR_SLEEP_Msk & ((value) << CAN_SR_SLEEP_Pos))  
#define CAN_SR_WAKEUP_Pos                     _U_(21)                                              /**< (CAN_SR) CAN Controller is not in Low-power Mode Position */
#define CAN_SR_WAKEUP_Msk                     (_U_(0x1) << CAN_SR_WAKEUP_Pos)                      /**< (CAN_SR) CAN Controller is not in Low-power Mode Mask */
#define CAN_SR_WAKEUP(value)                  (CAN_SR_WAKEUP_Msk & ((value) << CAN_SR_WAKEUP_Pos))
#define CAN_SR_TOVF_Pos                       _U_(22)                                              /**< (CAN_SR) Timer Overflow (automatically cleared by reading CAN_SR) Position */
#define CAN_SR_TOVF_Msk                       (_U_(0x1) << CAN_SR_TOVF_Pos)                        /**< (CAN_SR) Timer Overflow (automatically cleared by reading CAN_SR) Mask */
#define CAN_SR_TOVF(value)                    (CAN_SR_TOVF_Msk & ((value) << CAN_SR_TOVF_Pos))    
#define CAN_SR_TSTP_Pos                       _U_(23)                                              /**< (CAN_SR) Timestamp (automatically cleared by reading CAN_SR) Position */
#define CAN_SR_TSTP_Msk                       (_U_(0x1) << CAN_SR_TSTP_Pos)                        /**< (CAN_SR) Timestamp (automatically cleared by reading CAN_SR) Mask */
#define CAN_SR_TSTP(value)                    (CAN_SR_TSTP_Msk & ((value) << CAN_SR_TSTP_Pos))    
#define CAN_SR_CERR_Pos                       _U_(24)                                              /**< (CAN_SR) Mailbox CRC Error (automatically cleared by reading CAN_SR) Position */
#define CAN_SR_CERR_Msk                       (_U_(0x1) << CAN_SR_CERR_Pos)                        /**< (CAN_SR) Mailbox CRC Error (automatically cleared by reading CAN_SR) Mask */
#define CAN_SR_CERR(value)                    (CAN_SR_CERR_Msk & ((value) << CAN_SR_CERR_Pos))    
#define CAN_SR_SERR_Pos                       _U_(25)                                              /**< (CAN_SR) Mailbox Stuffing Error (automatically cleared by reading CAN_SR) Position */
#define CAN_SR_SERR_Msk                       (_U_(0x1) << CAN_SR_SERR_Pos)                        /**< (CAN_SR) Mailbox Stuffing Error (automatically cleared by reading CAN_SR) Mask */
#define CAN_SR_SERR(value)                    (CAN_SR_SERR_Msk & ((value) << CAN_SR_SERR_Pos))    
#define CAN_SR_AERR_Pos                       _U_(26)                                              /**< (CAN_SR) Acknowledgment Error (automatically cleared by reading CAN_SR) Position */
#define CAN_SR_AERR_Msk                       (_U_(0x1) << CAN_SR_AERR_Pos)                        /**< (CAN_SR) Acknowledgment Error (automatically cleared by reading CAN_SR) Mask */
#define CAN_SR_AERR(value)                    (CAN_SR_AERR_Msk & ((value) << CAN_SR_AERR_Pos))    
#define CAN_SR_FERR_Pos                       _U_(27)                                              /**< (CAN_SR) Form Error (automatically cleared by reading CAN_SR) Position */
#define CAN_SR_FERR_Msk                       (_U_(0x1) << CAN_SR_FERR_Pos)                        /**< (CAN_SR) Form Error (automatically cleared by reading CAN_SR) Mask */
#define CAN_SR_FERR(value)                    (CAN_SR_FERR_Msk & ((value) << CAN_SR_FERR_Pos))    
#define CAN_SR_BERR_Pos                       _U_(28)                                              /**< (CAN_SR) Bit Error (automatically cleared by reading CAN_SR) Position */
#define CAN_SR_BERR_Msk                       (_U_(0x1) << CAN_SR_BERR_Pos)                        /**< (CAN_SR) Bit Error (automatically cleared by reading CAN_SR) Mask */
#define CAN_SR_BERR(value)                    (CAN_SR_BERR_Msk & ((value) << CAN_SR_BERR_Pos))    
#define CAN_SR_RBSY_Pos                       _U_(29)                                              /**< (CAN_SR) Receiver Busy Position */
#define CAN_SR_RBSY_Msk                       (_U_(0x1) << CAN_SR_RBSY_Pos)                        /**< (CAN_SR) Receiver Busy Mask */
#define CAN_SR_RBSY(value)                    (CAN_SR_RBSY_Msk & ((value) << CAN_SR_RBSY_Pos))    
#define CAN_SR_TBSY_Pos                       _U_(30)                                              /**< (CAN_SR) Transmitter Busy Position */
#define CAN_SR_TBSY_Msk                       (_U_(0x1) << CAN_SR_TBSY_Pos)                        /**< (CAN_SR) Transmitter Busy Mask */
#define CAN_SR_TBSY(value)                    (CAN_SR_TBSY_Msk & ((value) << CAN_SR_TBSY_Pos))    
#define CAN_SR_OVLSY_Pos                      _U_(31)                                              /**< (CAN_SR) Overload busy Position */
#define CAN_SR_OVLSY_Msk                      (_U_(0x1) << CAN_SR_OVLSY_Pos)                       /**< (CAN_SR) Overload busy Mask */
#define CAN_SR_OVLSY(value)                   (CAN_SR_OVLSY_Msk & ((value) << CAN_SR_OVLSY_Pos))  
#define CAN_SR_Msk                            _U_(0xFFFF00FF)                                      /**< (CAN_SR) Register Mask  */

