Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/can.h
#define CAN_SR_MB_Pos                         _U_(0)                                               /**< (CAN_SR Position) Mailbox x Event */
#define CAN_SR_MB_Msk                         (_U_(0xFF) << CAN_SR_MB_Pos)                         /**< (CAN_SR Mask) MB */
#define CAN_SR_MB(value)                      (CAN_SR_MB_Msk & ((value) << CAN_SR_MB_Pos))         

/* -------- CAN_BR : (CAN Offset: 0x14) (R/W 32) Baudrate Register -------- */
#define CAN_BR_PHASE2_Pos                     _U_(0)                                               /**< (CAN_BR) Phase 2 Segment Position */
#define CAN_BR_PHASE2_Msk                     (_U_(0x7) << CAN_BR_PHASE2_Pos)                      /**< (CAN_BR) Phase 2 Segment Mask */
#define CAN_BR_PHASE2(value)                  (CAN_BR_PHASE2_Msk & ((value) << CAN_BR_PHASE2_Pos))
#define CAN_BR_PHASE1_Pos                     _U_(4)                                               /**< (CAN_BR) Phase 1 Segment Position */
#define CAN_BR_PHASE1_Msk                     (_U_(0x7) << CAN_BR_PHASE1_Pos)                      /**< (CAN_BR) Phase 1 Segment Mask */
#define CAN_BR_PHASE1(value)                  (CAN_BR_PHASE1_Msk & ((value) << CAN_BR_PHASE1_Pos))
#define CAN_BR_PROPAG_Pos                     _U_(8)                                               /**< (CAN_BR) Programming Time Segment Position */
#define CAN_BR_PROPAG_Msk                     (_U_(0x7) << CAN_BR_PROPAG_Pos)                      /**< (CAN_BR) Programming Time Segment Mask */
#define CAN_BR_PROPAG(value)                  (CAN_BR_PROPAG_Msk & ((value) << CAN_BR_PROPAG_Pos))
#define CAN_BR_SJW_Pos                        _U_(12)                                              /**< (CAN_BR) Re-synchronization Jump Width Position */
#define CAN_BR_SJW_Msk                        (_U_(0x3) << CAN_BR_SJW_Pos)                         /**< (CAN_BR) Re-synchronization Jump Width Mask */
#define CAN_BR_SJW(value)                     (CAN_BR_SJW_Msk & ((value) << CAN_BR_SJW_Pos))      
#define CAN_BR_BRP_Pos                        _U_(16)                                              /**< (CAN_BR) Baudrate Prescaler Position */
#define CAN_BR_BRP_Msk                        (_U_(0x7F) << CAN_BR_BRP_Pos)                        /**< (CAN_BR) Baudrate Prescaler Mask */
#define CAN_BR_BRP(value)                     (CAN_BR_BRP_Msk & ((value) << CAN_BR_BRP_Pos))      
#define CAN_BR_SMP_Pos                        _U_(24)                                              /**< (CAN_BR) Sampling Mode Position */
#define CAN_BR_SMP_Msk                        (_U_(0x1) << CAN_BR_SMP_Pos)                         /**< (CAN_BR) Sampling Mode Mask */
#define CAN_BR_SMP(value)                     (CAN_BR_SMP_Msk & ((value) << CAN_BR_SMP_Pos))      
#define   CAN_BR_SMP_ONCE_Val                 _U_(0x0)                                             /**< (CAN_BR) The incoming bit stream is sampled once at sample point.  */
#define   CAN_BR_SMP_THREE_Val                _U_(0x1)                                             /**< (CAN_BR) The incoming bit stream is sampled three times with a period of a peripheral clock, centered on sample point.  */
#define CAN_BR_SMP_ONCE                       (CAN_BR_SMP_ONCE_Val << CAN_BR_SMP_Pos)              /**< (CAN_BR) The incoming bit stream is sampled once at sample point. Position  */
#define CAN_BR_SMP_THREE                      (CAN_BR_SMP_THREE_Val << CAN_BR_SMP_Pos)             /**< (CAN_BR) The incoming bit stream is sampled three times with a period of a peripheral clock, centered on sample point. Position  */
#define CAN_BR_Msk                            _U_(0x017F3777)                                      /**< (CAN_BR) Register Mask  */


/* -------- CAN_TIM : (CAN Offset: 0x18) ( R/ 32) Timer Register -------- */
#define CAN_TIM_TIMER_Pos                     _U_(0)                                               /**< (CAN_TIM) Timer Position */
#define CAN_TIM_TIMER_Msk                     (_U_(0xFFFF) << CAN_TIM_TIMER_Pos)                   /**< (CAN_TIM) Timer Mask */
#define CAN_TIM_TIMER(value)                  (CAN_TIM_TIMER_Msk & ((value) << CAN_TIM_TIMER_Pos))
#define CAN_TIM_Msk                           _U_(0x0000FFFF)                                      /**< (CAN_TIM) Register Mask  */


/* -------- CAN_TIMESTP : (CAN Offset: 0x1C) ( R/ 32) Timestamp Register -------- */
#define CAN_TIMESTP_MTIMESTAMP_Pos            _U_(0)                                               /**< (CAN_TIMESTP) Timestamp Position */
#define CAN_TIMESTP_MTIMESTAMP_Msk            (_U_(0xFFFF) << CAN_TIMESTP_MTIMESTAMP_Pos)          /**< (CAN_TIMESTP) Timestamp Mask */
#define CAN_TIMESTP_MTIMESTAMP(value)         (CAN_TIMESTP_MTIMESTAMP_Msk & ((value) << CAN_TIMESTP_MTIMESTAMP_Pos))
#define CAN_TIMESTP_Msk                       _U_(0x0000FFFF)                                      /**< (CAN_TIMESTP) Register Mask  */


/* -------- CAN_ECR : (CAN Offset: 0x20) ( R/ 32) Error Counter Register -------- */
#define CAN_ECR_REC_Pos                       _U_(0)                                               /**< (CAN_ECR) Receive Error Counter Position */
#define CAN_ECR_REC_Msk                       (_U_(0xFF) << CAN_ECR_REC_Pos)                       /**< (CAN_ECR) Receive Error Counter Mask */
#define CAN_ECR_REC(value)                    (CAN_ECR_REC_Msk & ((value) << CAN_ECR_REC_Pos))    
#define CAN_ECR_TEC_Pos                       _U_(16)                                              /**< (CAN_ECR) Transmit Error Counter Position */
#define CAN_ECR_TEC_Msk                       (_U_(0x1FF) << CAN_ECR_TEC_Pos)                      /**< (CAN_ECR) Transmit Error Counter Mask */
#define CAN_ECR_TEC(value)                    (CAN_ECR_TEC_Msk & ((value) << CAN_ECR_TEC_Pos))    
#define CAN_ECR_Msk                           _U_(0x01FF00FF)                                      /**< (CAN_ECR) Register Mask  */


/* -------- CAN_TCR : (CAN Offset: 0x24) ( /W 32) Transfer Command Register -------- */
#define CAN_TCR_MB0_Pos                       _U_(0)                                               /**< (CAN_TCR) Transfer Request for Mailbox 0 Position */
#define CAN_TCR_MB0_Msk                       (_U_(0x1) << CAN_TCR_MB0_Pos)                        /**< (CAN_TCR) Transfer Request for Mailbox 0 Mask */
#define CAN_TCR_MB0(value)                    (CAN_TCR_MB0_Msk & ((value) << CAN_TCR_MB0_Pos))    
#define CAN_TCR_MB1_Pos                       _U_(1)                                               /**< (CAN_TCR) Transfer Request for Mailbox 1 Position */
#define CAN_TCR_MB1_Msk                       (_U_(0x1) << CAN_TCR_MB1_Pos)                        /**< (CAN_TCR) Transfer Request for Mailbox 1 Mask */
#define CAN_TCR_MB1(value)                    (CAN_TCR_MB1_Msk & ((value) << CAN_TCR_MB1_Pos))    
#define CAN_TCR_MB2_Pos                       _U_(2)                                               /**< (CAN_TCR) Transfer Request for Mailbox 2 Position */
#define CAN_TCR_MB2_Msk                       (_U_(0x1) << CAN_TCR_MB2_Pos)                        /**< (CAN_TCR) Transfer Request for Mailbox 2 Mask */
#define CAN_TCR_MB2(value)                    (CAN_TCR_MB2_Msk & ((value) << CAN_TCR_MB2_Pos))    
#define CAN_TCR_MB3_Pos                       _U_(3)                                               /**< (CAN_TCR) Transfer Request for Mailbox 3 Position */
#define CAN_TCR_MB3_Msk                       (_U_(0x1) << CAN_TCR_MB3_Pos)                        /**< (CAN_TCR) Transfer Request for Mailbox 3 Mask */
#define CAN_TCR_MB3(value)                    (CAN_TCR_MB3_Msk & ((value) << CAN_TCR_MB3_Pos))    
#define CAN_TCR_MB4_Pos                       _U_(4)                                               /**< (CAN_TCR) Transfer Request for Mailbox 4 Position */
#define CAN_TCR_MB4_Msk                       (_U_(0x1) << CAN_TCR_MB4_Pos)                        /**< (CAN_TCR) Transfer Request for Mailbox 4 Mask */
#define CAN_TCR_MB4(value)                    (CAN_TCR_MB4_Msk & ((value) << CAN_TCR_MB4_Pos))    
#define CAN_TCR_MB5_Pos                       _U_(5)                                               /**< (CAN_TCR) Transfer Request for Mailbox 5 Position */
#define CAN_TCR_MB5_Msk                       (_U_(0x1) << CAN_TCR_MB5_Pos)                        /**< (CAN_TCR) Transfer Request for Mailbox 5 Mask */
#define CAN_TCR_MB5(value)                    (CAN_TCR_MB5_Msk & ((value) << CAN_TCR_MB5_Pos))    
#define CAN_TCR_MB6_Pos                       _U_(6)                                               /**< (CAN_TCR) Transfer Request for Mailbox 6 Position */
#define CAN_TCR_MB6_Msk                       (_U_(0x1) << CAN_TCR_MB6_Pos)                        /**< (CAN_TCR) Transfer Request for Mailbox 6 Mask */
#define CAN_TCR_MB6(value)                    (CAN_TCR_MB6_Msk & ((value) << CAN_TCR_MB6_Pos))    
#define CAN_TCR_MB7_Pos                       _U_(7)                                               /**< (CAN_TCR) Transfer Request for Mailbox 7 Position */
#define CAN_TCR_MB7_Msk                       (_U_(0x1) << CAN_TCR_MB7_Pos)                        /**< (CAN_TCR) Transfer Request for Mailbox 7 Mask */
#define CAN_TCR_MB7(value)                    (CAN_TCR_MB7_Msk & ((value) << CAN_TCR_MB7_Pos))    
#define CAN_TCR_TIMRST_Pos                    _U_(31)                                              /**< (CAN_TCR) Timer Reset Position */
#define CAN_TCR_TIMRST_Msk                    (_U_(0x1) << CAN_TCR_TIMRST_Pos)                     /**< (CAN_TCR) Timer Reset Mask */
#define CAN_TCR_TIMRST(value)                 (CAN_TCR_TIMRST_Msk & ((value) << CAN_TCR_TIMRST_Pos))
#define CAN_TCR_Msk                           _U_(0x800000FF)                                      /**< (CAN_TCR) Register Mask  */

#define CAN_TCR_MB_Pos                        _U_(0)                                               /**< (CAN_TCR Position) Transfer Request for Mailbox x */
#define CAN_TCR_MB_Msk                        (_U_(0xFF) << CAN_TCR_MB_Pos)                        /**< (CAN_TCR Mask) MB */
#define CAN_TCR_MB(value)                     (CAN_TCR_MB_Msk & ((value) << CAN_TCR_MB_Pos))       

/* -------- CAN_ACR : (CAN Offset: 0x28) ( /W 32) Abort Command Register -------- */
#define CAN_ACR_MB0_Pos                       _U_(0)                                               /**< (CAN_ACR) Abort Request for Mailbox 0 Position */
#define CAN_ACR_MB0_Msk                       (_U_(0x1) << CAN_ACR_MB0_Pos)                        /**< (CAN_ACR) Abort Request for Mailbox 0 Mask */
#define CAN_ACR_MB0(value)                    (CAN_ACR_MB0_Msk & ((value) << CAN_ACR_MB0_Pos))    
#define CAN_ACR_MB1_Pos                       _U_(1)                                               /**< (CAN_ACR) Abort Request for Mailbox 1 Position */
#define CAN_ACR_MB1_Msk                       (_U_(0x1) << CAN_ACR_MB1_Pos)                        /**< (CAN_ACR) Abort Request for Mailbox 1 Mask */
#define CAN_ACR_MB1(value)                    (CAN_ACR_MB1_Msk & ((value) << CAN_ACR_MB1_Pos))    
#define CAN_ACR_MB2_Pos                       _U_(2)                                               /**< (CAN_ACR) Abort Request for Mailbox 2 Position */
#define CAN_ACR_MB2_Msk                       (_U_(0x1) << CAN_ACR_MB2_Pos)                        /**< (CAN_ACR) Abort Request for Mailbox 2 Mask */
#define CAN_ACR_MB2(value)                    (CAN_ACR_MB2_Msk & ((value) << CAN_ACR_MB2_Pos))    
#define CAN_ACR_MB3_Pos                       _U_(3)                                               /**< (CAN_ACR) Abort Request for Mailbox 3 Position */
#define CAN_ACR_MB3_Msk                       (_U_(0x1) << CAN_ACR_MB3_Pos)                        /**< (CAN_ACR) Abort Request for Mailbox 3 Mask */
#define CAN_ACR_MB3(value)                    (CAN_ACR_MB3_Msk & ((value) << CAN_ACR_MB3_Pos))    
#define CAN_ACR_MB4_Pos                       _U_(4)                                               /**< (CAN_ACR) Abort Request for Mailbox 4 Position */
#define CAN_ACR_MB4_Msk                       (_U_(0x1) << CAN_ACR_MB4_Pos)                        /**< (CAN_ACR) Abort Request for Mailbox 4 Mask */
#define CAN_ACR_MB4(value)                    (CAN_ACR_MB4_Msk & ((value) << CAN_ACR_MB4_Pos))    
#define CAN_ACR_MB5_Pos                       _U_(5)                                               /**< (CAN_ACR) Abort Request for Mailbox 5 Position */
#define CAN_ACR_MB5_Msk                       (_U_(0x1) << CAN_ACR_MB5_Pos)                        /**< (CAN_ACR) Abort Request for Mailbox 5 Mask */
#define CAN_ACR_MB5(value)                    (CAN_ACR_MB5_Msk & ((value) << CAN_ACR_MB5_Pos))    
#define CAN_ACR_MB6_Pos                       _U_(6)                                               /**< (CAN_ACR) Abort Request for Mailbox 6 Position */
#define CAN_ACR_MB6_Msk                       (_U_(0x1) << CAN_ACR_MB6_Pos)                        /**< (CAN_ACR) Abort Request for Mailbox 6 Mask */
#define CAN_ACR_MB6(value)                    (CAN_ACR_MB6_Msk & ((value) << CAN_ACR_MB6_Pos))    
#define CAN_ACR_MB7_Pos                       _U_(7)                                               /**< (CAN_ACR) Abort Request for Mailbox 7 Position */
#define CAN_ACR_MB7_Msk                       (_U_(0x1) << CAN_ACR_MB7_Pos)                        /**< (CAN_ACR) Abort Request for Mailbox 7 Mask */
#define CAN_ACR_MB7(value)                    (CAN_ACR_MB7_Msk & ((value) << CAN_ACR_MB7_Pos))    
#define CAN_ACR_Msk                           _U_(0x000000FF)                                      /**< (CAN_ACR) Register Mask  */

#define CAN_ACR_MB_Pos                        _U_(0)                                               /**< (CAN_ACR Position) Abort Request for Mailbox 7 */
#define CAN_ACR_MB_Msk                        (_U_(0xFF) << CAN_ACR_MB_Pos)                        /**< (CAN_ACR Mask) MB */
#define CAN_ACR_MB(value)                     (CAN_ACR_MB_Msk & ((value) << CAN_ACR_MB_Pos))       

/* -------- CAN_WPMR : (CAN Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define CAN_WPMR_WPEN_Pos                     _U_(0)                                               /**< (CAN_WPMR) Write Protection Enable Position */
#define CAN_WPMR_WPEN_Msk                     (_U_(0x1) << CAN_WPMR_WPEN_Pos)                      /**< (CAN_WPMR) Write Protection Enable Mask */
#define CAN_WPMR_WPEN(value)                  (CAN_WPMR_WPEN_Msk & ((value) << CAN_WPMR_WPEN_Pos))
#define CAN_WPMR_WPKEY_Pos                    _U_(8)                                               /**< (CAN_WPMR) Write Protection Key Password Position */
#define CAN_WPMR_WPKEY_Msk                    (_U_(0xFFFFFF) << CAN_WPMR_WPKEY_Pos)                /**< (CAN_WPMR) Write Protection Key Password Mask */
#define CAN_WPMR_WPKEY(value)                 (CAN_WPMR_WPKEY_Msk & ((value) << CAN_WPMR_WPKEY_Pos))
#define   CAN_WPMR_WPKEY_PASSWD_Val           _U_(0x43414E)                                        /**< (CAN_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0  */
#define CAN_WPMR_WPKEY_PASSWD                 (CAN_WPMR_WPKEY_PASSWD_Val << CAN_WPMR_WPKEY_Pos)    /**< (CAN_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0 Position  */
#define CAN_WPMR_Msk                          _U_(0xFFFFFF01)                                      /**< (CAN_WPMR) Register Mask  */


