Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/can.h
/* -------- CAN_WPSR : (CAN Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define CAN_WPSR_WPVS_Pos                     _U_(0)                                               /**< (CAN_WPSR) Write Protection Violation Status Position */
#define CAN_WPSR_WPVS_Msk                     (_U_(0x1) << CAN_WPSR_WPVS_Pos)                      /**< (CAN_WPSR) Write Protection Violation Status Mask */
#define CAN_WPSR_WPVS(value)                  (CAN_WPSR_WPVS_Msk & ((value) << CAN_WPSR_WPVS_Pos))
#define CAN_WPSR_WPVSRC_Pos                   _U_(8)                                               /**< (CAN_WPSR) Write Protection Violation Source Position */
#define CAN_WPSR_WPVSRC_Msk                   (_U_(0xFF) << CAN_WPSR_WPVSRC_Pos)                   /**< (CAN_WPSR) Write Protection Violation Source Mask */
#define CAN_WPSR_WPVSRC(value)                (CAN_WPSR_WPVSRC_Msk & ((value) << CAN_WPSR_WPVSRC_Pos))
#define CAN_WPSR_Msk                          _U_(0x0000FF01)                                      /**< (CAN_WPSR) Register Mask  */


/* -------- CAN_VERSION : (CAN Offset: 0xFC) ( R/ 32) Version Register -------- */
#define CAN_VERSION_VERSION_Pos               _U_(0)                                               /**< (CAN_VERSION) Hardware Module Version Position */
#define CAN_VERSION_VERSION_Msk               (_U_(0xFFF) << CAN_VERSION_VERSION_Pos)              /**< (CAN_VERSION) Hardware Module Version Mask */
#define CAN_VERSION_VERSION(value)            (CAN_VERSION_VERSION_Msk & ((value) << CAN_VERSION_VERSION_Pos))
#define CAN_VERSION_MFN_Pos                   _U_(16)                                              /**< (CAN_VERSION) Metal Fix Number Position */
#define CAN_VERSION_MFN_Msk                   (_U_(0x7) << CAN_VERSION_MFN_Pos)                    /**< (CAN_VERSION) Metal Fix Number Mask */
#define CAN_VERSION_MFN(value)                (CAN_VERSION_MFN_Msk & ((value) << CAN_VERSION_MFN_Pos))
#define CAN_VERSION_Msk                       _U_(0x00070FFF)                                      /**< (CAN_VERSION) Register Mask  */


/** \brief CAN register offsets definitions */
#define CAN_MMR_REG_OFST               (0x00)              /**< (CAN_MMR) Mailbox Mode Register Offset */
#define CAN_MAM_REG_OFST               (0x04)              /**< (CAN_MAM) Mailbox Acceptance Mask Register Offset */
#define CAN_MID_REG_OFST               (0x08)              /**< (CAN_MID) Mailbox ID Register Offset */
#define CAN_MFID_REG_OFST              (0x0C)              /**< (CAN_MFID) Mailbox Family ID Register Offset */
#define CAN_MSR_REG_OFST               (0x10)              /**< (CAN_MSR) Mailbox Status Register Offset */
#define CAN_MDL_REG_OFST               (0x14)              /**< (CAN_MDL) Mailbox Data Low Register Offset */
#define CAN_MDH_REG_OFST               (0x18)              /**< (CAN_MDH) Mailbox Data High Register Offset */
#define CAN_MCR_REG_OFST               (0x1C)              /**< (CAN_MCR) Mailbox Control Register Offset */
#define CAN_MR_REG_OFST                (0x00)              /**< (CAN_MR) Mode Register Offset */
#define CAN_IER_REG_OFST               (0x04)              /**< (CAN_IER) Interrupt Enable Register Offset */
#define CAN_IDR_REG_OFST               (0x08)              /**< (CAN_IDR) Interrupt Disable Register Offset */
#define CAN_IMR_REG_OFST               (0x0C)              /**< (CAN_IMR) Interrupt Mask Register Offset */
#define CAN_SR_REG_OFST                (0x10)              /**< (CAN_SR) Status Register Offset */
#define CAN_BR_REG_OFST                (0x14)              /**< (CAN_BR) Baudrate Register Offset */
#define CAN_TIM_REG_OFST               (0x18)              /**< (CAN_TIM) Timer Register Offset */
#define CAN_TIMESTP_REG_OFST           (0x1C)              /**< (CAN_TIMESTP) Timestamp Register Offset */
#define CAN_ECR_REG_OFST               (0x20)              /**< (CAN_ECR) Error Counter Register Offset */
#define CAN_TCR_REG_OFST               (0x24)              /**< (CAN_TCR) Transfer Command Register Offset */
#define CAN_ACR_REG_OFST               (0x28)              /**< (CAN_ACR) Abort Command Register Offset */
#define CAN_WPMR_REG_OFST              (0xE4)              /**< (CAN_WPMR) Write Protection Mode Register Offset */
#define CAN_WPSR_REG_OFST              (0xE8)              /**< (CAN_WPSR) Write Protection Status Register Offset */
#define CAN_VERSION_REG_OFST           (0xFC)              /**< (CAN_VERSION) Version Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief CAN_MB register API structure */
typedef struct
{
  __IO  uint32_t                       CAN_MMR;            /**< Offset: 0x00 (R/W  32) Mailbox Mode Register */
  __IO  uint32_t                       CAN_MAM;            /**< Offset: 0x04 (R/W  32) Mailbox Acceptance Mask Register */
  __IO  uint32_t                       CAN_MID;            /**< Offset: 0x08 (R/W  32) Mailbox ID Register */
  __I   uint32_t                       CAN_MFID;           /**< Offset: 0x0C (R/   32) Mailbox Family ID Register */
  __I   uint32_t                       CAN_MSR;            /**< Offset: 0x10 (R/   32) Mailbox Status Register */
  __IO  uint32_t                       CAN_MDL;            /**< Offset: 0x14 (R/W  32) Mailbox Data Low Register */
  __IO  uint32_t                       CAN_MDH;            /**< Offset: 0x18 (R/W  32) Mailbox Data High Register */
  __O   uint32_t                       CAN_MCR;            /**< Offset: 0x1C ( /W  32) Mailbox Control Register */
} can_mb_registers_t;

#define CAN_MB_NUMBER _U_(8)

/** \brief CAN register API structure */
typedef struct
{
  __IO  uint32_t                       CAN_MR;             /**< Offset: 0x00 (R/W  32) Mode Register */
  __O   uint32_t                       CAN_IER;            /**< Offset: 0x04 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       CAN_IDR;            /**< Offset: 0x08 ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       CAN_IMR;            /**< Offset: 0x0C (R/   32) Interrupt Mask Register */
  __I   uint32_t                       CAN_SR;             /**< Offset: 0x10 (R/   32) Status Register */
  __IO  uint32_t                       CAN_BR;             /**< Offset: 0x14 (R/W  32) Baudrate Register */
  __I   uint32_t                       CAN_TIM;            /**< Offset: 0x18 (R/   32) Timer Register */
  __I   uint32_t                       CAN_TIMESTP;        /**< Offset: 0x1C (R/   32) Timestamp Register */
  __I   uint32_t                       CAN_ECR;            /**< Offset: 0x20 (R/   32) Error Counter Register */
  __O   uint32_t                       CAN_TCR;            /**< Offset: 0x24 ( /W  32) Transfer Command Register */
  __O   uint32_t                       CAN_ACR;            /**< Offset: 0x28 ( /W  32) Abort Command Register */
  __I   uint8_t                        Reserved1[0xB8];
  __IO  uint32_t                       CAN_WPMR;           /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   uint32_t                       CAN_WPSR;           /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
  __I   uint8_t                        Reserved2[0x10];
  __I   uint32_t                       CAN_VERSION;        /**< Offset: 0xFC (R/   32) Version Register */
  __I   uint8_t                        Reserved3[0x100];
        can_mb_registers_t             CAN_MB[CAN_MB_NUMBER]; /**< Offset: 0x200  */
} can_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAM9X_CAN_COMPONENT_H_ */
